{
	"S1" :"<S1> If at any time the Robot operation or Team actions are deemed unsafe or have damaged the Field Elements or Scoring Objects, the offending Team may be Disabled and/or Disqualified by the determination of the referees. The Robot will require re-inspection before it may again take the field.\n\na. Teams should be extra cautious when interacting with Scoring Objects. Damage to Scoring objects can be ruled as a violation of <S1>.",
	"S2" :"<S2> If a Robot is completely out-of-bounds (outside the playing field), it will be Disabled for theremainder of the Match.\nNote: The intent is NOT to penalize Robots for having mechanisms that inadvertently cross the field border during normal game play.",
	
	"G1"  :"<G1> All Teams are expected to conduct themselves in a respectful and professional manner while competing in VEX Robotics Competition events. If a Team or any of its members (Students or any adults associated with the Team) are disrespectful or uncivil to event staff, volunteers, or fellow competitors, they may be Disqualified from a current or upcoming Match, or even the entirety of the event depending on the severity of the situation. It is important to remember that we are all judged based on how we deal with adversity. It is important that we all exhibit maturity and class when dealing with any difficult situations that may present themselves in both the VEX Robotics Competition and our lives in general.",
	"G2"  :"<G2> When reading and applying the various rules in this document, please remember that common sense always applies in the VEX Robotics Competition.",
	"G3"  :"<G3> At the beginning of a Match, each Robot must be smaller than a volume of 18” (457.2 mm)long by 18” (457.2 mm) wide by 18” (457.2 mm) tall. An offending Robot will be removed from the match at the Head Referee’s discretion.",
	"G4"  :"<G4> Each Team shall include up to three Drive Team Members. No Drive Team Member may fulfill this role for more than one Team at any given event.",
	"G5"  :"<G5> Drive Team Members may only touch the Team’s controls, Robot, and Scoring Objects at specified times during a Match as per <G5a> and <SG3>. Drive Team Members are prohibited from making intentional contact with any Scoring Object, Field Element or Robot during a Match, with the exception of the contact specified in <G5a> and <SG3>.\n\na. During the Driver Controlled Period, Drive Team Members may handle their own Robot if no part of the robot has moved at all during the Match. The type of fixes that are allowed are limited to the following: \n\ta. Turning the Robot on or off \n\tb. Plugging in a battery and/or power expander \n\tc. Plugging in a VEXnet Key \n\td. Turning the power expander on or off \n\nb. Drive Team Members are not permitted to break the plane of field perimeter at any time during the match, with the exception of the actions described in <G5a> and <SG3>. \n\nMinor violations of these rules that do not affect the Match will result in a warning. Match Affecting offenses will result in a Disqualification. Teams that receive multiple warnings may also receive a Disqualification at the Head Referee's discretion.",
	"G6"  :"<G6> During a Match, the Drive Team Members must remain in their Alliance Station. Drive Team Members are not allowed to use any sort of communication devices during their Match. Devices with communication features turned off (e.g. a phone in airplane mode) are allowed.",
	"G7"  :"<G7> During the qualification rounds, the red Alliance has the right to place its Robots on the field last. During the elimination rounds, the higher seeded Alliance has the right to place its Robots on the field last. Once a Team has placed its Robot on the field, its position cannot be readjusted prior to the Match. A Team that violates this rule will have its robots randomly repositioned by the referees. \n\na. Robots must be placed on the field promptly. Repeated failure to do so could result in a violation of <G1>",
	"G8"  :"<G8> During a Match, Robots may be operated only by the Drive Team Members and/or by software running on the Robot’s control system. During the Autonomous Period Drive Team Members are not permitted to interact with the Robot, the controls on their VEXnet Joysticks, or to unplug from the field in any way, directly or indirectly. (e.g. Triggering sensors without touching the Robot is still illegal.) Minor violations of this rule that do not affect the Match will result in a warning. Match Affecting offenses will result in a Disqualification. Teams that receive multiple warnings may also receive a Disqualification at the Head Referee's discretion.",
	"G9"  :"<G9> Scores will be calculated for all Matches immediately after the Match once all objects and Robots on the field come to rest. The determination of the Autonomous Bonus will occur for all Matches immediately after the Autonomous Period after all objects and Robots on the field come to rest.",
	"G10" :"<G10> Any infractions committed during the Autonomous Period that are not Match Affecting, but do affect the outcome of the Autonomous Bonus, will result in the Autonomous Bonus being automatically awarded to the opposing Alliance. ",
	"G11" :"<G11> Robots may not intentionally detach parts during any Match, or leave mechanisms on the field. Minor violations of this rule that do not affect the Match will result in a warning. Match Affecting offenses will result in a Disqualification. Teams that receive multiple warnings may also receive a Disqualification at the Head Referee's discretion. Multiple intentional infractions may result in Disqualification for the entire competition.",
	"G12" :"<G12> Strategies aimed solely at the destruction, damage, tipping over, or Entanglement of Robots are not part of the ethos of the VEX Robotics Competition and are not allowed. However, VEX Robotics Competition In the Zone is an interactive game. Some incidental tipping, Entanglement, and damage may occur as a part of normal game play. If the tipping, Entanglement, or damage is ruled to be intentional or egregious, the offending Team may be disqualified from that Match. Repeated offenses could result in a Team being Disqualified from the remainder of the competition. \n\nVEX Robotics Competition In the Zone is intended to be an offensive game. Teams that partake in solely defensive strategies will undergo extra scrutiny in regard to <G12>. In the case where referees are forced to make a judgment call on interaction between a defensive and offensive Robot, the referees will err on the side of the offensive Robot. \n\nA Team is responsible for the actions of its Robot at all times, including the Autonomous Period. This goes for Teams that are driving recklessly and potentially causing damage, but also goes for Teams that drive around with a small wheel base. A Team should design its Robot such that it is not easily tipped over or damaged by minor contact.",
	"G13" :"<G13> Intentional strategies causing an opponent to violate a rule are not permitted, and will not result in an infraction on the opposing alliance. \n\nMinor violations of this rule that do not affect the Match will result in a warning. Match Affecting offenses will result in a Disqualification. Teams that receive multiple warnings may also receive a Disqualification at the Head Referee's discretion.",
	"G14" :"<G14> Robots must be designed to permit easy removal of Scoring Objects from any mechanism without requiring the Robot to have power after a Match",
	"G15" :"<G15> Field tolerances may vary by as much as ±1”, except where otherwise noted, so Teams must design Robots accordingly. Please make sure to check Appendix A for more specific tolerances. Note: The field perimeter should always be resting upon the Field Perimeter Rubber Feet, regardless of whether or not the tabs have been cut off the foam field tiles.",
	"G16" :"<G16> Replays are at the discretion of the Event Partner and Head Referee, and will only be issued in the most extreme circumstances.",
	"G17" :"<G17> All Teams must adhere to all VEX Robotics Competition Rules as they are written and must abide by the stated intent of the rules. Every Team has the opportunity to ask for official rules interpretations in the VEX Robotics Competition Question & Answer Forum. All responses in this Q&A forum should be treated as official rulings from the VEX Robotics Competition Game Design Committee, and they represent the correct and official interpretation of the VEX Robotics Competition Rules. \n\nThere may also be periodic “Team Updates” posted on the VEX Robotics Competition In the Zone webpage in the competition section of www.vexrobotics.com and www.roboticseducation.org. These updates are also “official” parts of the VEX Robotics Competition In the Zone rules. \n\nThe VEX Robotics Competition Question & Answer Forum can be found at www.vexforum.com, or directly at http://www.vexrobotics.com/In_the_Zone.",
	"G18" :"<G18> All rules in this manual are subject to changes, and not considered official until August 17th, 2017. We do not expect any major changes to take place, however we do reserve the right to make game changes until August 17th, 2017. There will also be scheduled manual updates on June 15th, 2017 and April 5th, 2018. \n\na. The Game Design Committee reserves the right to make changes to this manual in the April 5th, 2018 release specifically for the VEX Robotics World Championship. Specific items which will be considered for changes are the number of Cones and Mobile Goals.",
	
	"SG1"  :"<SG1> At the beginning of each Match, each Robot must be placed such that it is touching the Alliance’s Starting Bar, not touching any Scoring Object other than those permitted by <SG2> and not touching another Robot.",
	"SG2"  :"<SG2> Prior to the start of each Match, each Robot must use its one (1) Cone available as a Preload. A Cone is considered to be legally preloaded if it is touching the Robot, not touching another Robot, and is fully within the field perimeter. If a Robot is not present for their Match, their Cone will be placed randomly such that it is touching the Alliance Starting Bar.",
	"SG3"  :"<SG3> There can only ever be one (1) Cone on a Loader at any given time. There will be one (1) Cone on the Loader to start the Match. Additional Cones may be loaded by a Drive Team Member onto the Loader at any point during the Match. Cones must be placed upright and upon the Loader. Robots may not contact a Cone if it is being touched by a human. \n\nNote: Cones are considered to be “in play” once they are placed on the Loader and may no longer be contacted by Drive Team Members. \n\n\ta. Robots may not contact Cones on the opposing Alliance Loader. \n\nMinor violations of this rule that do not affect the Match will result in a warning. Match Affecting offenses will result in a Disqualification. Teams that receive multiple warnings may also receive a Disqualification at the Head Referee's discretion.",
	"SG4"  :"<SG4> A Robot may not Pin or Trap an opposing Robot for more than five seconds during the Driver Controlled Period. A Pin or Trap is officially over once the Pinning Robot has moved away and the Robots are separated by at least 2 feet (approximately one (1) foam tile). After ending a Pin or Trap, a Robot may not Pin or Trap the same Robot again for a duration of 5 seconds; if a Team does pin the same Robot again, the pinning count will resume from where it left off when the pinning Robot initially backed off. \n\nMinor violations of this rule that do not affect the match will result in a warning. Match Affecting offenses will result in a Disqualification. Teams that receive multiple warnings may also receive a Disqualification at the Head Referee's discretion. There is no penalty for Pinning during the Autonomous Period.",
	"SG5"  :"<SG5> Robots may not intentionally or accidentally, indirectly or directly, remove Cones from an opponent’s Stack. \n\n\ta. A Robot that accidentally knocks over an opponent’s Goal, causing Cones to be removed, would be in violation of this rule. Teams should exercise extreme caution when interacting with or around opponent Goals. \n\nMinor violations of this rule that do not affect the match will result in a warning. Match Affecting offenses will result in a Disqualification. Teams that receive multiple warnings may also receive a Disqualification at the Head Referee's discretion.",
	"SG6"  :"<SG6> Robots may not intentionally grasp, grapple or attach to any Field Elements or the opposing Mobile Goals. Strategies with mechanisms that react against multiple sides of a Field Element in an effort to latch onto said Field Element are prohibited. The intent of this rule is to prevent Teams from both unintentionally damaging the field and/or from anchoring themselves to the field. Minor violations of this rule that do not affect the Match will result in a warning. Match Affecting offenses  will result in a Disqualification. Teams that receive multiple warnings may also receive a Disqualification at the Head Referee's discretion.",
	"SG7"  :"<SG7> Two Robots on the same Alliance may not work in tandem to block access to portions of the field. Examples include, but are not limited to, two Robots blocking access to: \n\n\t• Scoring Zones \n\t• Corners of the field (especially in an effort remove access to Cones or Mobile Goals) \n\t• The Loader \n\nNote: Robots incidentally blocking access to portions of the field while attempting to Stack Cones on Goals, Score Mobile Goals in Goal Zones or while Parking is an expected part of game play. \n\nMinor violations of this rule that do not affect the match will result in a warning. Match Affecting offenses will result in a Disqualification. Teams that receive multiple warnings may also receive a Disqualification at the Head Referee's discretion.",
	"SG8"  :"<SG8> It is expected that Scoring Objects may unintentionally leave the field during Match play. Scoring Objects that leave the playing field will not be returned. Teams may not intentionally remove Scoring Objects from the field while not in the process of Scoring/Stacking. We do expect Scoring Objects to leave the field accidently during intentional Scoring/Stacking, however doing so intentionally or repeatedly would be a violation of this rule. \n\nMinor violations of this rule that do not affect the Match will result in a warning. Match Affecting offenses will result in a Disqualification. Teams that receive multiple warnings may also receive a Disqualification at the Head Referee's discretion",
	"SG9"  :"<SG9> Robots may not Possess more than one (1) Cone at a time. Minor violations of this rule that do not affect the Match will result in a warning. Match Affecting offenses will result in a Disqualification. Teams that receive multiple warnings may also receive a Disqualification at the Head Referee's discretion. \n\nNote: An intent of this rule is to prevent Robots from hoarding Cones by pushing them. The intent is not to punish Robots for pushing Cones that are in their way. Robots that intentionally plow multiple Cones to a specific location of the field, even with a flat/convex portion of their Robot, would be in violation of this rule. Robots are allowed to drive through Cones that are in their way. Teams are not allowed to use this to employ Cone hoarding strategies. \n\nNote 2: Stacked Cones do not count towards the Possession limit. (i.e. A Robot is allowed to control  the movement of a Mobile Goal with Stacked Cones). Robots can interact with Cones that are Stacked on Goals without those Cones counting towards the possession limit.",
	"SG10" :"<SG10> Robots may not contact the opposing Alliance’s 10 Point Zone or 20 Point Zone. \n\n\ta. Robots may not contact an opposing Robot that is contacting opposing Robot’s 10 Point Zone, 20 Point Zone, or Starting Bar. \n\nMinor violations of this rule that do not affect the Match will result in a warning. Match Affecting offenses will result in a Disqualification. Teams that receive multiple warnings may also receive a Disqualification at the Head Referee's discretion. ",
	"SG11" :"<SG11> Robots may not put a Mobile Goal in an opposite Goal Zone. (i.e. A Robot, regardless of Alliance, cannot put a red Mobile Goal in a blue Goal Zone or a blue Mobile Goal in a red Goal Zone.) \n\nMinor violations of this rule that do not affect the Match will result in a warning. Match Affecting offenses will result in a Disqualification. Teams that receive multiple warnings may also receive a Disqualification at the Head Referee's discretion. ",
	"SG12" :"<SG12> Robots may not intentionally drop or place Scoring Objects on an opponent Robot. \n\nMinor violations of this rule that do not affect the Match will result in a warning. Match Affecting offenses will result in a Disqualification. Teams that receive multiple warnings may also receive a Disqualification at the Head Referee's discretion.",
	"SG13" :"<SG13> At the start of the Match all Scoring Objects on the field will be placed upright in their designated locations, however the rotation is not specified.",
	"SG14" :"<SG14> As per <G3>, at the beginning of a Match, each Robot must be smaller than a volume of 18” (457.2 mm) long by 18” (457.2 mm) wide by 18” (457.2 mm) tall. Once the Match begins, Robots may expand, but must remain within a vertical cylinder with a diameter of 36” (914.4 mm) and infinite height. The Robot may not exceed this limit for the duration of the Match. \n\nMinor violations of this rule that do not affect the Match will result in a warning. Match Affecting offenses will result in a Disqualification. Teams that receive multiple warnings may also receive a Disqualification at the Head Referee's discretion. \n\n\ta. There is no height limit on Robot expansion.",
	
	"R1"  :"<R1> Only one (1) robot will be allowed to compete per team in the VEX Robotics Competition. Though it is expected that teams will make changes to their robot at the competition, a team is limited to only one (1) robot. As such, a VEX robot, for the purposes of the VEX Robotics Competition, has the following subsystems: \n\n**Subsystem 1**: Mobile robotic base including wheels, tracks, legs, or any other mechanism that allows the robot to navigate the majority of the flat playing field surface. For a stationary robot, the robotic base without wheels would be considered Subsystem 1. \n**Subsystem 2**: Power and control system that includes a VEX legal battery, a VEX control system, and associated motors for the mobile robotic base. \n**Subsystem 3**: Additional mechanisms (and associated motors) that allow manipulation of game objects or navigation of field obstacles. \n\nGiven the above definitions, a minimum robot for use in any VEX Robotics Competition event (including skills challenges) must consist of 1 and 2 above. Thus if you are swapping out an entire subsystem of either item 1 or 2, you have now created a second robot and are no longer legal. \n\n\t**a.** Teams may not compete with one robot, while a second is being modified or assembled. \n\n\t**b.** Teams may not switch back and forth between multiple robots during a competition.",
	"R2"  :"<R2> Every robot will be required to pass a full inspection before being cleared to compete. This inspection will ensure that all robot rules and regulations are met. Initial inspections will take place during team registration/practice time. \n\n\ta. If significant changes are made to a robot, it must be re-inspected before it will be allowed to compete. \n\n\tb. All robot configurations must be inspected before being used in competition. \n\n\tc. Teams may be requested to submit to random spot-inspections by event personnel. Refusal to submit will result in disqualification. \n\n\td. Referees or inspectors may decide that a robot is in violation of the rules. In this event, the team in violation will be disqualified and the robot will be barred from the playing field until it passes re-inspection.",
	"R3"  :"<R3> The following types of mechanisms and components are NOT allowed: \n\n\t**a.** Those that could potentially damage playing field components. \n\t**b**. Those that could potentially damage other competing robots. \n\t**c**. Those that pose an unnecessary risk of entanglement.",
	"R4"  :"<R4> At the beginning of any match, robots must be smaller than 18” x 18” x 18”. \n\n\ta. During inspections, robots will be measured in one of two ways \n\n\t\t**i.** Robots will be placed into a “sizing box” which has interior dimensions matching the above size constraints. To pass inspection, a robot must fit within the box without touching the box walls or ceiling. \n\t\t**ii**. Robots will be sized using a VEX Robotics Competition Robot Sizing Tool. Robots will be placed on a flat surface and must not touch the measurement slide as it is passed over the surface. Please see http://www.vexrobotics.com/vex/products/competitionproducts/vrc-products/276-2086.html for a visual reference. \n\n\tb. Robots may expand beyond their starting size constraints after the start of a match. \n\n\tc. Any restraints used to maintain starting size (i.e. zip ties, rubber bands, etc.) MUST remain attached to the robot for the duration of the match.",
	"R5"  :"<R5> Robots may be built ONLY from Official Robot Components from the VEX Robotics Design System unless otherwise specifically noted within these rules. \n\n\t**a.** During inspections if there is a question about whether something is an official VEX component, a team will be required to provide documentation to an inspector, which proves the component’s source. Such types of documentation include receipts, part numbers, or other printed documentation. \n\n\t**b.** Only the VEX Robotics Design System Components specifically designed to be used for Robot construction are allowed. Using additional components outside their typical purpose is against the intent of the rule (i.e. please don’t try using VEX apparel, competition support materials, packaging or other non-robot products on a VEX Robotics Competition Robot). \n\n\t**c.** Products from the VEXpro, VEX IQ, or VEX Robotics by HEXBUG product line cannot be used for robot construction, unless specifically allowed by a clause of <R7>. Products from the VEXpro or VEX IQ, or VEX Robotics by HEXBUG product line which are also cross listed as part of the VEX product line are legal. \n\n\t**d.** Official Robotics Components from the VEX Robotics Design System which have been discontinued are still legal for competition use. However teams must be cognizant of <R5a>.",
	"R6"  :"<R6> Official VEX products are ONLY available from VEX & Official VEX Resellers. To determine whether a product is “official” or not, consult www.vexrobotics.com.",
	"R7"  :"<R7> Robots are allowed the following additional “non-VEX” components: \n\n\t**a.** Any material strictly used as a color filter or a color marker for a VEX Light Sensor. \n\n\t**b.** Any parts which are identical to legal VEX parts. For the purposes of this rule, products which are **identical** in all ways except for color are permissible. Note: It is up to inspectors to determine whether a component is “identical” to an official VEX component. \n\n\t**c.** Any commercially available #4, #6, #8, M2, M2.5, M3 or M4 screw up to 2' long, and any commercially available nut and/or washer to fit these screws. \n\n\t**d.** Teams may add non-functional decorations provided that these do not affect the robot performance in any significant way or affect the outcome of the match. These decorations must be in the spirit of the competition. Inspectors will have final say in what is considered “nonfunctional”. \n\n\t\t**i.** Anodizing and painting of parts would be considered a legal nonfunctional decoration \n\t\t**ii.** Any guards or decals must be backed by legal materials that provide the same functionality. i.e. If your robot has a giant decal that prevents Scoring Objects from falling out of the robot, the decal must be backed by VEX material that also prevents the Scoring Objects from falling out. \n\t\t**iii.** If using the VEX speaker (Part #276-1504), the chosen audio must not be distracting and must be in good taste. The Head Inspector and Head Referee will make the final decision on the appropriateness of the audio. \n\t\t**iv.** Cameras are permitted as non-functional decorations provided that any transmitting functions or wireless communications are disabled. Unusually large cameras being used as ballast are not permitted. \n\n\t**e.** Any non-aerosol based grease or lubricating compound, when used in extreme moderation on surfaces and locations that do NOT come into contact with the playing field walls, foam field surface, game objects, or other robots. \n\n\t*f.* Non shattering plastic from the following list; polycarbonate, acetel monopolymer (Delrin), acetal copolymer (Acetron GP), POM (acetal), ABS, PEEK, PET, HDPE, LDPE, Nylon (all grades), Polypropylene, FEP; as cut from a single 12' x 24' sheet up to 0.070' thick. \n\t\t**i.** Plastic can be mechanically altered by cutting, drilling or bending etc., but it cannot be chemically treated, melted or cast. Teams may heat the polycarbonate to aid in bending. \n\n\t**g.** A small amount of tape may be used for the following purposes: \n\t\t**i.** For the sole purpose of securing any connection between the ends of two (2) VEX cables. \n\t\t**ii.** For labeling wires and motors. \n\t\t**iii.** Teflon tape solely for the purposes of preventing leaks may be used on the threaded portions of pneumatic fittings. \n\t\t**iv.** For securing and retaining a VEXnet key to the VEX ARM® Cortex®-based Microcontroller. Using tape in this manner is highly recommended to ensure a robust connection. \n\n\t**h.** Hot glue for securing cable connections \n\n\t**j.** A USB extension cable may be used for the sole purpose of remote mounting of a VEXnet key. The key must be mounted in the following manner. \n\t\t**i.** The VEXnet key must be mounted such that no metal is touching the key above the VEXnet logo. \n\t\t**ii.** We highly recommend that no metal may be within 2” of the top of the VEXnet key. \n\n\t**k.** An unlimited amount of 1/8”, braided, nylon rope \n\n\t**l.** Commercially available items used solely for the purpose of bundling or wrapping of 2-wire, 3-wire, 4-wire cables, and pneumatic tubing, for the purposes of protection, organization, or management are allowed. This includes but is not limited to electrical tape, cable carrier, cable track, etc. Note: it is up to inspectors to determine whether a component is serving a function beyond protecting and managing cables. \n\n\t**m.** VEX IQ pins used solely for the purpose of attaching VEX Team Identification Number Plates.",
	"R8"  :"<R8> Additional VEX Robotics Design System Components that are released during the competition season are considered legal for use. \n\nSome “new” components may have certain restrictions placed on them upon their release. These restrictions will be documented in a Team Update. Team Updates will be posted to the VRC In the Zone home page in the Competition section of www.VEXrobotics.com",
	"R9"  :"<R9> Robots must use ONLY one (1) VEX EDR Microcontroller. \n\n\t**a.** Examples of VEX EDR Microcontrollers are the VEX v.5 PIC Microcontroller and the VEX ARM® Cortex®-based Microcontroller. \n\n\t**b.** Microcontrollers that are part of other VEX product lines such as VEXpro, VEX RCR, VEX IQ, or VEX Robotics by HEXBUG are not allowed.",
	"R10" :"<R10> Robots must ONLY utilize the VEXnet system for all robot communication. \n\n\t**a.** VEX 75Mhz Crystal Radios are prohibited. (Some events may allow the use of 75Mhz Crystal Radios, please see the Special Event Rule Modifications later in this section.) \n\n\t**b.** Electronics from the VEXpro, VEX-RCR, VEX IQ, or VEX Robotics by HEXBUG product line are prohibited including all VEXplorer electronics. \n\n\t**c.** A VEXnet Joystick may only be used in conjunction with a VEX ARM® Cortex®-based Microcontroller. A VEXnet upgraded 75MHz Transmitter may only be used in conjunction with a PIC Microcontroller. Mixing and matching VEXnet transmitters and receivers is prohibited.",
	"R11" :"<R11> Robots may use either: \n\n**Option 1**: Up to ten (10) VEX EDR motors or VEX Servos (Any combination, up to ten) and a legal VRC pneumatic system. (See <R18>) \n\n**Option 2**: Up to twelve (12) VEX EDR motors or VEX Servos (Any combination, up to twelve) and no pneumatic components, excluding pneumatic tubing. \n\n\t**a.** 2-Wire Motors must be controlled by a 2-Wire Motor Port, either directly on a VEX Microcontroller (P/N 276-2194), or on a VEX Motor Controller 29 module. \n\n\t**b.** Teams may NOT use multiple 2-wire Motor Ports, 3-wire PWM Motor Ports, or Motor Controller 29 modules on a single motor.",
	"R12" :"<R12> A maximum of one (1) VEX Y-cable can be used per Motor Port of the Microcontroller or Power Expander. (You cannot 'Y off a Y' to have more than two (2) motors controlled by the same Motor Port.) \n\n\t**a.** Teams using the VEX ARM® Cortex®-based Microcontroller can only power one (1) 2-wire Motor per each of the two 2-wire motor ports on the Microcontroller. It is illegal to 'Y' off a 2-wire Motor Port. \n\n\t**b.** Teams may not 'Y' off a Motor Controller 29",
	"R13" :"<R13> The only allowable sources of electrical power for a VEX Robotics Competition Robot is any single (1) VEX 7.2V Robot Battery Pack of any type, unless the robot is utilizing the VEX Power Expander, and a single (1) 9V backup battery. Robots utilizing the VEX Power Expander can use a second (2) VEX 7.2V Robot Battery of any type. \n\n\t**a.** Additional batteries cannot be used on the robot (even ones that aren’t connected). \n\n\t**b.** Robots are permitted to use a maximum of one (1) VEX Power Expander. \n\n\t**c.** To ensure reliable wireless communication, it is required that all teams connect a charged 9V Backup battery to their VEXnet system using the VEXnet Backup Battery Holder (276-2243). \n\n\t**d.** Any VEX 7.2V Battery Pack is legal, in the quantities described above. \n\n\t**e.** The only legal means for charging a VEX 7.2V Battery Pack is via one of the following VEX Battery Chargers: Smart Charger, 276-1445; Smart Charger v2, 276-2519; 276-2221 (discontinued), 276-2235 (discontinued). All other chargers are strictly prohibited. \n\n\t**f.** VEXnet Joysticks must only be powered by AAA batteries. \n\n\t\t**i.** Some events may provide field power for VEXnet Joysticks. If this is provided for all teams at the event, this is a legal source of power for VEXnet Joysticks.",
	"R14" :"<R14> No more than two VEX hand-held transmitters may control a single robot during the tournament. No modification of these transmitters is allowed of ANY kind. \n\n\t**a.** No other methods of controlling the robot (light, sound, etc) are permissible.",
	"R15" :"<R15> Parts may NOT be modified as follows: \n\n\t**a.** Motors (including the internal PTC), extension cords, sensors, controllers, battery packs, reservoirs, solenoids, pistons and any other electrical component or pneumatics component of the VEX Robotics Design System may NOT be altered from their original state in ANY way. \n\n\t\t**i.** Internal or external mechanical repairs of VEX Limit and Bumper switches are permitted; using components from these devices in other applications is prohibited \n\n\t\t**ii.** External wires on VEX electrical components may be repaired by soldering, using twist/crimp connectors, electrical tape or shrink tubing such that the original functionality / length is not modified in any way. Wire used in repairs must be identical to VEX wire. **Teams may make these repairs at their own risk; incorrect wiring may have undesired results.** \n\n\t\t**iii.** Teams may change or replace the gears in the “2-Wire 393” or “2-Wire 269” motors, with the corresponding official VEX Replacement Gears \n\n\t\t**iv.** Teams may cut pneumatic tubing to a desired length \n\n\t**b.** Welding, soldering, brazing, gluing, or attaching in any way that is not provided within the VEX Robotics Design System will NOT be allowed. \n\n\t\t**i.** Mechanical fasteners may be secured using Loctite or a similar thread-locking product; this may be used for securing hardware ONLY. \n\n\t\t**ii.** Teams are permitted to fuse/melt the end of the 1/8” nylon rope to prevent fraying \n\n\t\t**iii.** The gluing permitted by <R7h> is an exception to this rule.",
	"R16" :"<R16> The Robot on/off switch must be accessible without moving or lifting the robot. The Robot Microcontroller lights should also be visible by competition personnel to assist in diagnosing robot problems.",
	"R17" :"<R17> Teams must bring their robots to the field prepared to play. Teams who use VEX pneumatics must have their systems charged before they place the robot on the field.",
	"R18" :"<R18> Pneumatic devices may only be charged to a maximum of 100 psi. Teams may only use a maximum of two (2) legal VEX pneumatic air reservoirs on a Robot. \n\nThe intent of this rule is to limit teams to the air pressure stored in two reservoir tanks, as well as the normal working air pressure contained in their pneumatic cylinders and tubing on the robot. Teams may not use other elements (e.g. surgical tubing) for the purposes of storing air pressure. Teams who use cylinders and additional pneumatic tubing for no purpose other than additional storage are in violation of the spirit of this rule and will fail inspection.",
	"R19" :"<R19> To participate in an official VEX Robotics Competition Tournament a team must first register on robotevents.com. Upon registering they will receive their VEX Team Identification Number (VEX Team ID#) and a welcome kit containing VEX Team Identification Number Plates. Every robot should have their VEX Team ID# Plates displayed on a minimum of 2-opposing sides. \n\n\t**a.** The VEX Team Identification Number Plates are considered a non-functional decoration, and cannot be used as a functional part of the robot. \n\n\t**b.** These number plates must fulfill all robot rules (i.e. they must fit within the 18” cube per <R4>, they cannot cause entanglement, etc.) \n\n\t**c.** Robots must use the colored plates that match their alliance color for each match. (i.e. Robots on the red alliance must have their red plates on for the match) It must be abundantly clear which color alliance the robot belongs to.",
	"R20" :"<R20> During the Autonomous Period, human operators will not be allowed to use their hand-held controllers. As such, teams are responsible for programming their robot with custom software if they want to perform in Autonomous mode. \n\nFor more information on this, teams should consult the help guides produced by the developers of their chosen programming software.",
	"R21" :"<R21> Any violation of robot rules will result in a team being unable to play until they pass inspection (per <R2d>). In addition, teams who intentionally circumvent or violate rules to gain an advantage over their fellow competitors are in violation of the spirit and ethos of the competition. As such, anyone caught violating a rule in this manner may be disqualified from upcoming matches, the event, or even future events at the discretion of the VEX Robotics Competition Game Design Committee.",
	
	"VUG1" :"<VUG1> Instead of a 2-team vs. 2-team format, VEX U matches will be played 1-team vs. 1-team in 2017-18: each team will only use ONE (1) Robot in each match. \n\n**a.** Teams are allowed to build as many Robots as they would like, but only one (1) may be used on the field during a Match. They may only bring one (1) Robot from the pit to the playing field for any Match. \n\n**b.** All Robots must pass inspection before they are allowed to compete.",
	"VUG2" :"<VUG2> Qualification matches will be conducted like normal, in the 1 v 1 format described above.",
	"VUG3" :"<VUG3> An elimination tournament will be conducted similar to the Middle School & High School tournament. At the end of the competition, ONE team will emerge as the event champion.",
	"VUG4" :"<VUG4> The Autonomous Period at the beginning of every Match will be 45 seconds. \n\n\t**a.** All interaction with robots during the Autonomous Period is strictly prohibited. The intent of this rule is to ensure College teams are encouraged to develop advanced autonomous routines.",
	"VUG5" :"<VUG5> The Driver Control Period will be shortened to 75 seconds and immediately follows the Autonomous Period.",
	"VUG6" :"<VUG6> Each team will have thirteen (13) Cones available as Match Control Loads. These are subject to same restrictions listed in Section 2 of the VRC In the Zone Game Manual..",
	"VUG7" :"<VUG7> Once the Match begins, Robots may expand beyond the starting size defined in <VUR1>, but must remain within a vertical cylinder with a diameter of 48” (1219.2 mm) and infinite height. The Robot may not exceed this limit for the duration of the Match.",
	
	"VUR1"  :"<VUR1> Teams must build all robots subject to the following size restrictions at the start of the match: \n\n\t**a.** Robots must be smaller than 24” x 24” x 24”.",
	"VUR2"  :"<VUR2> Teams are allowed to fabricate their own unique VEX parts from the following additional items, for each of their robots: \n\n\t**a.** Plastic cut from a single 6” x 6” x 1” block. \n\n\t\t**i.** Examples of “plastic block” are PVC, Delrin, and ABS. \n\n\t**b.** Steel OR Aluminum cut from a single sheet no larger than 12” x 12” and no thicker than 0.070” \n\n\t**c.** An unlimited number of plastic 3D printed parts, each less than 3” x 6” x 6”. \n\nNote: these are not measured by “volume”. Teams are restricted as though the components they are constructing were made from the raw materials listed.",
	"VUR3"  :"<VUR3> Each Robot is allowed to utilize up to one (1) VEX ARM® Cortex®-based Microcontroller \n\n**a.** No other types of VEX Microcontroller are permitted.",
	"VUR4"  :"<VUR4> Each Robot is permitted to use up to twelve (12) VEX EDR motors or VEX Servos (Any combination, up to twelve).",
	"VUR5"  :"<VUR5> Each Robot must use one (1) VEXnet module.",
	"VUR6"  :"<VUR6>Each Robot is still only allowed up to two (2) operators and one (1) coach. \n\n\t**a.** Drivers MUST be post-secondary school individuals. \n\n\t\t**i.** Any individual enrolled in a post-secondary school is eligible to be a driver. \n\n\t\t**ii.** There are no restrictions on who can be a Coach in VEX U. \n\n\t\t**iii.** Professionals not enrolled in post-secondary education are also NOT eligible to be a driver.",
	"VUR7"  :"<VUR7> There is NO restriction on sensors and additional electronics used for sensing and processing except as follows: \n\n\t**a.** Sensors and Electronics MUST be connected to the VEX ARM® Cortex®-based Microcontroller, and can only be connected via any of the externally accessible ports. \n\n\t**b.** Sensors and Electronics CANNOT directly electrically interface with the VEX motors, motor controllers, or solenoids. \n\n\t**c.** The additional Sensors and Electronics may only receive power from any of the following: \n\n\t\t**i.** Directly from the VEX ARM® Cortex®-based Microcontroller via any externally accessible port. \n\n\t\t**ii.** From an additional VEX 7.2V Robot Battery or from a VEX 9.6V Transmitter Battery (only one (1) additional battery can be used for sensor power.)",
	"VUR8"  :"<VUR8> Additional Motors, Servos and Actuators are NOT allowed.",
	"VUR9"  :"<VUR9> No R/F communication is allowed between robots. However other non R/F forms of communication are permitted. (i.e. IR, ultrasonic, etc.).",
	"VUR10" :"<VUR10> Teams must display their team identification letters (e.g. “IFI”, “ABCD”) in two visible locations on opposing sides of the Robot. The team identification letters in total must be at least 2” high and 3” wide.",
	
	"RSC1" :"<RSC1> At the beginning of each Robot Skills Match, the Robot must be placed such that it is touching a Starting Bar and not touching any Scoring Object other than those permitted by <RSC2>. \n\n\t**a.** Teams may elect to start their Robot at either the red or blue Starting Bar \n\n\t**b.** Drive Team Members are restricted to the Alliance Station of the same color as the Starting Bar the Robot starts from.",
	"RSC2" :"<RSC2> Prior to the start of each Robot Skills Match, the Robot must use its one (1) Cone available as a Preload. A Cone is considered to be legally preloaded if it is touching the Robot, and is fully within the field perimeter.",
	"RSC3" :"<RSC3> In a Robot Skills Match, all Goals, Zones, Parking Tiles, and Starting Bars are considered to be the same color for purposes of any rules or definitions. \n\n\t**a.** Robots may Stack Cones on any color of Goal for points. \n\n\t**b.** Robots may Score Goals in any color of Zone for points. \n\n\t**c.** Robots may Park on any color of Parking Tile for points.",
	
	"5 POINT ZONE"                  :"[5pt Zone] One of two (2) areas of foam field tiles, one (1) for each alliance, in which Robots can Score Mobile Goals. The 5 Point Zone is defined by the inner edges of the playing field walls, the Starting Bar, and the diagonal white tape line. \n\nNote: The tape and Starting Bar are considered to be a part of the 5 Point Zone",
	"10 PPINT ZONE"                 :"[10pt Zone] One of two (2) areas of foam field tiles, one (1) for each alliance, in which Robots can Score Mobile Goals. The 10 Point Zone is defined by the inner edges of the playing field walls, the Starting Bar, and the large ~2.375” (60.325 mm) pipe that separates the 10 Point Zone and the 20 Point Zone. \n\nNote 1: The Starting Bar is not considered to be a part of the 10 Point Zone \n\nNote 2: The large pipe is considered to be part of the 10 Point Zone",
	"20 POINT ZONE"                 :"[20pt Zone] 20 Point Zone – One of two (2) areas of foam field tiles, one (1) for each alliance, in which Robots can Score a Mobile Goal. The 20 Point Zone is defined by the inner edges of the playing field walls and the large ~2.375” (60.325 mm) pipe that separates The 10 Point Zone and 20 Point Zone. \n\nNote 1: The large pipe is not considered to be in the 20 Point Zone. \n\nNote 2: Only one Mobile Goal can be Scored in each 20 Point Zone.",
	"ALLIANCE"                      :"[Alliance] A pre-assigned grouping of two Teams that are paired together during a given Match.",
	"ALLIANCE STATION"              :"[Alliance Station]The designated region where the Drive Team Members must remain for the duration of the Match",
	"AUTONOMOUS BONUS"              :"[Autonomous Bonus] A bonus awarded to the Alliance that Scores the most Cone & Goal points during the Autonomous Period.",
	"AUTONOMOUS PERIOD"             :"[Autonomous Period] A 15-second (0:15) time period at the start of the Match during which Robots operate and react only to sensor inputs and to commands pre-programmed by the Students into the Robot control system.",
	"CONE"                          :"[Cone] A yellow plastic conical shaped Scoring Object with an overall height of approximately 7” (177.8mm) and a base diameter of approximately 6” (152.4 mm). Cones may be Stacked on Goals to earn points. Each Cone weighs approximately 0.26 lbs (117.9g)",
	"DISABLEMENT"                   :"[Disablement] A penalty applied to a Team for a rule violation. During Disablement a Team is no longer allowed to operate their robot and the Drive Team Members will be asked to place their controller(s) on the ground.",
	"DISQUALIFICATION"              :"[Disqualification] A penalty applied to a Team for a rule violation. A Team that is Disqualified in a Qualifying Match receives zero (0) Win Points, Autonomous Points, and Strength of Schedule Points. When a Team is Disqualified in an Elimination Match the entire Alliance is Disqualified and they receive a loss for the Match. At the Head Referee’s discretion, repeated violations and Disqualifications for a single Team may lead to its Disqualification for the entire tournament.",
	"DRIVE TEAM MEMBER"             :"[Drive Team Member] Any of the three (3) Students allowed in the Alliance Station during a Match for each Team. Only Drive Team Members are allowed to touch the controls at any time during the Match, interact with the Robot as per <G5>, and interact with Scoring Objects as per <SG3>. Adults are not allowed to be Drive Team Members.",
	"DRIVER CONTROLLED PERIOD"      :"[Driver Controlled Period] The one minute and forty-five second (1:45) time period during which the Student Drive Team Members operate the Robots.",
	"ENTANGLEMENT"                  :"[Entanglement] A Robot is considered to have Entangled an opposing Robot if it has grabbed or hooked the opponent Robot, as per <G12>.",
	"FIELD ELEMENT"                 :"[Field Element] The foam field tiles, field perimeter, Loader, Stationary Goal, Starting Bar, pipes that demarcate the Goal Zones, and all supporting structures.",
	"GOAL"                          :"[Goal] A Mobile Goal or a Stationary Goal.",
	"GOAL ZONE"                     :"[Goal Zone] A 5 Point Zone, 10 Point Zone, or 20 Point Zone",
	"HIGHEST STACK"                 :"[Highest Stack] A Highest Stationary Goal, Highest 5 Point Zone, Highest 10 Point Zone, or Highest 20 Point Zone Stack",
	"HIGHEST STATIONARY GOAL STACK" :"[Highest Stationary Goal Stack] The Stack on a Stationary Goal with the most Cones.",
	"HIGHEST 5 POINT ZONE STACK"    :"[Highest 5pt Zone Stack] The Stack on a Scored Goal in 5 Point Zone with the most Cones",
	"HIGHEST 10 POINT ZONE STACK"   :"[Highest 10pt Zone Stack] The Stack on a Scored Goal in 10 Point Zone with the most Cones",
	"HIGHEST 20 POINT ZONE STACK"   :"[Highest 20pt Zone Stack] The Stack on a Scored Goal in 20 Point Zone with the most Cones",
	"LOADER"                        :"[Loader] A designated location where Drive Team Members may place Match Loads during a Match.",
	"MATCH"                         :"[Match] A Match consists of an Autonomous Period followed by a Driver Controlled Period for a total time of two minutes (2:00).",
	"MATCH AFFECTING"               :"[Match Affecting] A situation that results in a change of the winner and loser of a Match.",
	"MATCH LOADS"                   :"[Match Loads] The twenty-four (24) Cones, twelve (12) per Alliance, that Drive Team Members may place onto their Loader at any point during the Match, one at a time.",
	"MOBILE GOAL"                   :"[Mobile Goal] One of the eight (8) conical Scoring Objects with an overall height of approximately 10” (254 mm) and a maximal base diameter of 10” (254 mm). There are four (4) red and four (4) blue Mobile Goals. Each Mobile Goal weighs approximately 3.7 lbs (1.68 kg) Cones may be Stacked on Mobile Goals to earn points. Mobile Goals may also be Scored in Goal Zones to earn points.",
	"PARKED"                        :"[Parked] A Robot is considered to be Parked if it is touching one of its Alliance’s Parking Tiles at the end of the Match. Only one Robot can earn Parking points on a single Parking Tile.",
	"PARKING TILE"                  :"[Parking Tile] A red or blue tile that designates the location where Robots can earn points for Parking at the end of the Match.",
	"PINNING"                       :"[Pinning] A Robot is considered to be Pinning an opposing Robot if it is inhibiting the movement of an opponent Robot while the opposing Robot is in contact with the foam playing surface and another Field Element",
	"PRELOAD"                       :"[Preload] The four (4) Cones, one (1) per robot, that must be placed on the field such they satisfy the following conditions, as per <SG2>, at the start of the Match: \n\n\t• The Preload is touching its Robot and no other Robot. \n\t• The Preload is fully within the field perimeter.",
	"POSSESSING"                    :"[Possessing] A Robot is considered to be Possessing a Cone if it is carrying, holding, or controlling the movement of a Cone in the Robot. Pushing/plowing Cones is not considered Possession, however using concave portions of your Robot to control the movement of Cones is considered Possession.",
	"ROBOT"                         :"[Robot] Anything that has passed inspection that a Team places on the field prior to the start of a Match.",
	"SCORED"                        :"[Scored] A Mobile Goal is Scored in a Goal Zone if it meets all of the following criteria: \n\n\t1. The Mobile Goal is touching the Goal Zone \n\t\ta. If a Mobile Goal is touching multiple Goal Zones it is Scored in the higher point value Goal Zone \n\t2. The Mobile Goal is not touching a Robot of the same color Alliance. \n\t3. The Mobile Goal and the Goal Zone belong to the same Alliance. \n\nNote 1: Only one Mobile Goal can be Scored in each 20 Point Zone. \n\nNote 2: If multiple Mobile Goals are in a scored position in a 20 Point Zone, the Mobile Goal with the most Cones Stacked will be the one that is Scored. \n\nNote 3: If a Mobile Goal is not touching a Zone, but is entirely Supported by other Scoring Objects it counts as being Scored in the highest value Scoring Zone of the Supporting Scoring Objects.",
	"SCORING OBJECT"                :"[Scoring Object] A Cone or a Mobile Goal.",
	"STACKED"                       :"[Stacked] A Cone is Stacked on a Goal if it is not touching a Robot of the same color Alliance as the Goal and either: \n\n\ta) Fully nested on a Goal (see Figures 5 & 6). \n\tb) Fully nested on a Stacked Cone (see Figures 7 & 8). \n\n 1: Cones still count as being Stacked even if the Mobile Goal that they are Stacked on is not Scored. \n\nNote 2: By these definitions, if a Robot is touching a Cone on a Mobile Goal, that Cone and any above it will not count as being Stacked. \n\nNote 3: Cones are not considered Stacked unless the Goal upon which they are fully nested is upright. Stacked Cones on tilted Goals are fine (e.g. a Mobile Goal resting partially on top of a Zone pipe or Cone), however Cones that are fully nested upon a Goal that has been knocked over will not count as Stacked.",
	"STARTING BAR"                  :"[Starting Bar] The ~1” (25.4 mm) pipe that separates the 5 Point Zone and the 10 Point Zone and also designates the location of Robots at the start of the Match as per <SG1>.",
	"STATIONARY GOAL"               :"[Stationary Goal] One of the two (2) posts with a conical top with an overall height of approximately 25” (635 mm). There is one (1) red and one (1) blue Stationary Goal. Cones may be Stacked on Stationary Goals to earn points",
	"STUDENT"                       :"[Student] Anyone enrolled in a pre-college school or is home-schooled as part of a pre-college educational curriculum and is born after April 28th, 1999. Eligibility may also be granted based on a disability that has delayed education by at least one year. \n\n\t• Middle School Student – A Student enrolled in grade 8 or lower, or enrolled in grade 9 in a school which includes grade 8, but not grade 10. \n\t• High School Student – Any eligible Student that is not a Middle School Student",
	"SUPPORTED"                     :"[Supported] A Scoring Object is considered to be Supported if it would no longer occupy the same position if the “supporting” object were to disappear. Referees will check to see if Scoring Objects are Supported by gently pulling away the supporting object if possible.",
	"TEAM"                          :"[Team] One or more Students make up a Team. A Team is classified as a Middle School Team if all members are Middle School Students. A Team is classified as a High School Team if any of its members are High School Students. Teams may be associated with schools, community/youth organizations, or a group of neighborhood Students",
	"TRAPPING"                      :"[Trapping] A Robot is considered to be trapped if an opposing Robot has restricted it into a small, confined area of the field, approximately the size of one foam field tile or less, and has not provided an avenue for escape.",
	"ZONE"                          :"[Zone] A 5 Point Zone, 10 Point Zone, or 20 Point Zone",
	
	"DRIVING SKILLS MATCH"     :"Driving Skills Match – A Driving Skills Match consists of a sixty (60) second Driver Controlled Period. There is no Autonomous Period. Teams can elect to end their run early, however this will count as an official run.",
	"PROGRAMMING SKILLS MATCH" :"Programming Skills Match – A Programming Skills Match consists of a sixty (60) second Autonomous Period. There is no Driver Controlled Period. Teams can elect to end their run early, however this will count as an official run.",
	"ROBOT SKILLS LOADS"       :"Robot Skills Loads – The twelve (12) Cones that Drive Team Members may place onto their Loader at any point during the Skills Match, one at a time.",
	"ROBOT SKILLS PRELOAD"     :"Robot Skills Preload – The one (1) Cone that must be placed on the field such it satisfies the following conditions, as per <RSC2>, at the start of the Skills Match: \n\n\t• The Skills Preload is touching the Robot. \n\n\t• The Skills Preload is fully within the field perimeter.",
	"ROBOT SKILLS MATCH"       :"Robot Skills Match – A Driver Skills Match or Programming Skills Match."
}
